#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader must be replaced
-/+ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
      ~ cluster_subnet = "10.244.0.0/16" -> (known after apply)
      ~ created_at     = "2020-03-15 07:58:25 +0000 UTC" -> (known after apply)
      ~ endpoint       = "https://9329c2de-f4e2-4f80-be4c-16fefb26477e.k8s.ondigitalocean.com" -> (known after apply)
      ~ id             = "9329c2de-f4e2-4f80-be4c-16fefb26477e" -> (known after apply)
      ~ ipv4_address   = "138.197.199.67" -> (known after apply)
      ~ kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
      ~ service_subnet = "10.245.0.0/16" -> (known after apply)
      ~ status         = "running" -> (known after apply)
        tags           = [
            "prod",
        ]
      ~ updated_at     = "2020-03-21 22:42:22 +0000 UTC" -> (known after apply)
      ~ version        = "1.16.6-do.2" -> "1.16.6-do.0" # forces replacement

      ~ node_pool {
          ~ actual_node_count = 4 -> (known after apply)
            auto_scale        = true
          ~ id                = "526d45ba-e14f-437e-883e-54bcf648a21f" -> (known after apply)
          - labels            = {} -> null
            max_nodes         = 5
            min_nodes         = 1
            name              = "worker-pool"
          - node_count        = 0 -> null
          ~ nodes             = [
              - {
                  - created_at = "2020-03-21 22:17:49 +0000 UTC"
                  - droplet_id = "185707694"
                  - id         = "2ee566c0-2957-4e77-abb1-c5e9ddc8bfaa"
                  - name       = "worker-pool-ztyu"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:17:49 +0000 UTC"
                  - droplet_id = "185707693"
                  - id         = "14dd9710-576e-4ee0-8964-4aa27ae062a8"
                  - name       = "worker-pool-ztyc"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:22:19 +0000 UTC"
                  - droplet_id = "185707970"
                  - id         = "7b627b3d-ccfa-47aa-baa7-9acd70824252"
                  - name       = "worker-pool-ztyk"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:23:39 +0000 UTC"
                },
              - {
                  - created_at = "2020-03-21 22:25:29 +0000 UTC"
                  - droplet_id = "185708224"
                  - id         = "61f51359-a05f-4ee0-af3d-7369aed110f0"
                  - name       = "worker-pool-ztxu"
                  - status     = "running"
                  - updated_at = "2020-03-21 22:26:50 +0000 UTC"
                },
            ] -> (known after apply)
            size              = "s-2vcpu-4gb"
          - tags              = [] -> null
        }
    }

  # module.infrastructure.module.kubernetes_config.helm_release.zeppelin will be created
  + resource "helm_release" "zeppelin" {
      + atomic                     = false
      + chart                      = "zeppelin"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "zeppelin"
      + namespace                  = "content"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.1.1"
      + wait                       = true
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
